Revit 2024 API
ParameterTypeId.RepeatingDetailNumber Property
 "Number"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId RepeatingDetailNumber { get; }
Visual Basic
Public Shared ReadOnly Property RepeatingDetailNumber As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ RepeatingDetailNumber {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace